<?php  if ( ! defined('BASEPATH')) exit('No direct script access allowed');
/*
| -------------------------------------------------------------------
| Foreign Characters
| -------------------------------------------------------------------
| This file contains an array of foreign characters for transliteration
| conversion used by the Text helper
|
*/
$foreign_characters = array(
	'/盲|忙|墙/' => 'ae',
	'/枚|艙/' => 'oe',
	'/眉/' => 'ue',
	'/脛/' => 'Ae',
	'/脺/' => 'Ue',
	'/脰/' => 'Oe',
	'/脌|脕|脗|脙|脛|脜|呛|膧|膫|膭|菎/' => 'A',
	'/脿|谩|芒|茫|氓|腔|膩|膬|膮|菐|陋/' => 'a',
	'/脟|膯|膱|膴|膶/' => 'C',
	'/莽|膰|膲|膵|膷/' => 'c',
	'/脨|膸|膼/' => 'D',
	'/冒|膹|膽/' => 'd',
	'/脠|脡|脢|脣|膾|臄|臇|臉|臍/' => 'E',
	'/猫|茅|锚|毛|膿|臅|臈|臋|臎/' => 'e',
	'/臏|臑|臓|蘑/' => 'G',
	'/臐|臒|摹|模/' => 'g',
	'/膜|摩/' => 'H',
	'/磨|魔/' => 'h',
	'/脤|脥|脦|脧|抹|莫|默|菑|漠|陌/' => 'I',
	'/矛|铆|卯|茂|末|墨|沫|菒|寞|谋/' => 'i',
	'/拇/' => 'J',
	'/牡/' => 'j',
	'/亩/' => 'K',
	'/姆/' => 'k',
	'/墓|幕|慕|目|艁/' => 'L',
	'/暮|募|木|艀|艂/' => 'l',
	'/脩|艃|艆|艊/' => 'N',
	'/帽|艅|艈|艌|艍/' => 'n',
	'/脪|脫|脭|脮|艑|艓|菓|艕|茽|脴|蔷/' => 'O',
	'/貌|贸|么|玫|艒|艔|菕|艖|啤|酶|强|潞/' => 'o',
	'/艛|艝|艠/' => 'R',
	'/艜|艞|艡/' => 'r',
	'/艢|艤|艦|艩/' => 'S',
	'/艣|艥|艧|拧|趴/' => 's',
	'/泞|扭|纽/' => 'T',
	'/牛|钮|脓/' => 't',
	'/脵|脷|脹|浓|弄|努|女|虐|挪|漂|菗|菚|菞|菣|菦/' => 'U',
	'/霉|煤|没|农|奴|怒|暖|疟|懦|瓢|菙|菛|菢|菤|菧/' => 'u',
	'/脻|鸥|哦/' => 'Y',
	'/媒|每|欧/' => 'y',
	'/糯/' => 'W',
	'/诺/' => 'w',
	'/殴|呕|沤/' => 'Z',
	'/藕|偶|啪/' => 'z',
	'/脝|羌/' => 'AE',
	'/脽/'=> 'ss',
	'/牟/' => 'IJ',
	'/某/' => 'ij',
	'/艗/' => 'OE',
	'/茠/' => 'f'
);

/* End of file foreign_chars.php */
/* Location: ./application/config/foreign_chars.php */